app/views/announcements/main_page.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."announcement_id" = $1  [["announcement_id", 1]]
---
               </div>
               <div align="left"> <%= announcement.comments.count %> Comments</div>