app/views/announcements/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."announcement_id" = $1  [["announcement_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."announcement_id" = $1  [["announcement_id", 1]]
---
<br>
<h2> <%= @announcement.comments.count %> Comments </h2>