app/controllers/announcements_controller.rb

SELECT "announcements".* FROM "announcements" ORDER BY announcement.publicationDate ASC
---
  def index
    @announcements = Announcement.all

INSERT INTO "announcements" ("publicationDate", "headline", "subhead", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @announcement = Announcement.new(announcement_params)

    respond_to do |format|
      if @announcement.save

UPDATE "announcements" SET "subhead" = $1, "updated_at" = $2 WHERE "announcements"."id" = $3  [["subhead", "caso 7"], ["updated_at", 2017-03-08 22:51:58 UTC], ["id", 28]]
---
  def update
    respond_to do |format|
      if @announcement.update(announcement_params)

DELETE FROM "announcements" WHERE "announcements"."id" = $1  [["id", 21]]
---
  def destroy
    @announcement.destroy

SELECT  "announcements".* FROM "announcements" WHERE "announcements"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
    def set_announcement
      @announcement = Announcement.find(params[:id])