app/controllers/comments_controller.rb

  def create
    @announcement = Announcement.find(params[:announcement_id])
    @comment = @announcement.comments.create(params[:comment].permit(:name, :body))
---
INSERT INTO "comments" ("name", "body", "announcement_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "first comment"], ["body", "a pretty one"], ["announcement_id", 1], ["created_at", 2017-03-15 00:42:52 UTC], ["updated_at", 2017-03-15 00:42:52 UTC]]

  def destroy
    @announcement = Announcement.find(params[:announcement_id])
    @comment = @announcement.comments.find(params[:id])
    @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."announcement_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["announcement_id", 1], ["id", 2], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]